# Lecture 7 - Functions, Pandas, Data Cleaning, and Preparation

In this lecture we will talk more about:
    
- Functions in Python
- Writing python programs and running them from the Terminal
- Pandas Dataframes

## Pandas

This tutorial has been adapted from the creator of [Pandas, Wes McKinney](https://github.com/wesm/pydata-book).

In [1]:
import numpy as np
import pandas as pd

# Remember to always import pandas

## Data loading

Last time, and in Lab 3, we talked about loading data in Python using pandas.

Let's talk now about how to clean and prepare data using Pandas.

## Handling Missing Data

In [2]:
string_data = pd.DataFrame(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
string_data.isnull()

       0
0  False
1  False
2   True
3  False

In [3]:
string_data[0] = None
string_data.isnull()

      0
0  True
1  True
2  True
3  True

### Filtering Out Missing Data

In [4]:
from numpy import nan as NA
data = pd.DataFrame([1, NA, 3.5, NA, 7])
data.dropna()

     0
0  1.0
2  3.5
4  7.0

In [5]:
data[data.notnull()]

     0
0  1.0
1  NaN
2  3.5
3  NaN
4  7.0

In [6]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [7]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [8]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [9]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [10]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.920979       NaN       NaN
1 -0.191444       NaN       NaN
2  0.595117       NaN -0.868397
3  1.567890       NaN  2.014625
4  1.113235 -1.993335 -0.137399
5 -0.244015  0.596371  1.029223
6  0.337890  0.242005  1.291402

In [12]:
df.dropna()

          0         1         2
4  1.113235 -1.993335 -0.137399
5 -0.244015  0.596371  1.029223
6  0.337890  0.242005  1.291402

In [13]:
df.dropna(thresh=2)

          0         1         2
2  0.595117       NaN -0.868397
3  1.567890       NaN  2.014625
4  1.113235 -1.993335 -0.137399
5 -0.244015  0.596371  1.029223
6  0.337890  0.242005  1.291402

### Filling In Missing Data

In [14]:
df.fillna(0)

          0         1         2
0  0.920979  0.000000  0.000000
1 -0.191444  0.000000  0.000000
2  0.595117  0.000000 -0.868397
3  1.567890  0.000000  2.014625
4  1.113235 -1.993335 -0.137399
5 -0.244015  0.596371  1.029223
6  0.337890  0.242005  1.291402

In [15]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.920979  0.500000  0.000000
1 -0.191444  0.500000  0.000000
2  0.595117  0.500000 -0.868397
3  1.567890  0.500000  2.014625
4  1.113235 -1.993335 -0.137399
5 -0.244015  0.596371  1.029223
6  0.337890  0.242005  1.291402

In [16]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  0.920979  0.000000  0.000000
1 -0.191444  0.000000  0.000000
2  0.595117  0.000000 -0.868397
3  1.567890  0.000000  2.014625
4  1.113235 -1.993335 -0.137399
5 -0.244015  0.596371  1.029223
6  0.337890  0.242005  1.291402

In [17]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df
df.fillna(method='ffill')
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.263070  0.462140 -0.278031
1 -0.772517  1.147276 -0.099587
2 -1.265060  1.147276 -0.062820
3 -0.595346  1.147276  0.300342
4 -0.831531       NaN  0.300342
5  1.408023       NaN  0.300342

In [18]:
data = pd.DataFrame([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

          0
0  1.000000
1  3.833333
2  3.500000
3  3.833333
4  7.000000

## Data Transformation

### Removing Duplicates

In [19]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [20]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [21]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [22]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [23]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [24]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [25]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [26]:
lowercased = data['food'].str.lower()
lowercased
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [27]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [28]:
data = pd.DataFrame([1., -999., 2., -999., -1000., 3.])
data

        0
0     1.0
1  -999.0
2     2.0
3  -999.0
4 -1000.0
5     3.0

In [29]:
data.replace(-999, np.nan)

        0
0     1.0
1     NaN
2     2.0
3     NaN
4 -1000.0
5     3.0

In [30]:
data.replace([-999, -1000], np.nan)

     0
0  1.0
1  NaN
2  2.0
3  NaN
4  NaN
5  3.0

In [31]:
data.replace([-999, -1000], [np.nan, 0])

     0
0  1.0
1  NaN
2  2.0
3  NaN
4  0.0
5  3.0

In [32]:
data.replace({-999: np.nan, -1000: 0})

     0
0  1.0
1  NaN
2  2.0
3  NaN
4  0.0
5  3.0

### Renaming Axis Indexes

In [33]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [34]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [35]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [36]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [37]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [38]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [39]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [40]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [41]:
cats.codes
cats.categories
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [42]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [43]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [44]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.29, 0.51], (0.074, 0.29], (0.074, 0.29], (0.51, 0.73], (0.074, 0.29], ..., (0.51, 0.73], (0.29, 0.51], (0.29, 0.51], (0.29, 0.51], (0.51, 0.73]]
Length: 20
Categories (4, interval[float64]): [(0.074, 0.29] < (0.29, 0.51] < (0.51, 0.73] < (0.73, 0.96]]

In [45]:
data = np.random.randn(1000)  # Normally distributed
cats = pd.qcut(data, 4)  # Cut into quartiles
cats
pd.value_counts(cats)

(0.643, 2.86]        250
(-0.0167, 0.643]     250
(-0.668, -0.0167]    250
(-3.564, -0.668]     250
dtype: int64

In [46]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.253, -0.0167], (-1.253, -0.0167], (-1.253, -0.0167], (-0.0167, 1.302], (1.302, 2.86], ..., (1.302, 2.86], (1.302, 2.86], (-0.0167, 1.302], (-1.253, -0.0167], (-1.253, -0.0167]]
Length: 1000
Categories (4, interval[float64]): [(-3.564, -1.253] < (-1.253, -0.0167] < (-0.0167, 1.302] < (1.302, 2.86]]

### Detecting and Filtering Outliers

In [47]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.064418     0.023265     0.025648    -0.023994
std       1.020388     1.019034     0.990072     1.014811
min      -3.083680    -3.732285    -3.165089    -3.487063
25%      -0.615654    -0.622421    -0.628045    -0.692036
50%       0.083076     0.034501     0.011147    -0.008419
75%       0.782310     0.711217     0.723474     0.715762
max       3.163753     3.055873     3.345627     2.853351

In [48]:
col = data[2]
col[np.abs(col) > 3]

192    3.345627
267   -3.165089
Name: 2, dtype: float64

In [49]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
44  -0.468458 -3.732285  0.756879  0.406498
161  0.002400 -3.716756  1.873407  1.794444
192  1.165503  0.022317  3.345627  0.477135
225 -2.211050  1.313702 -0.442210 -3.487063
234 -0.831582 -3.021859  0.554124 -0.581546
267  1.257885  2.250521 -3.165089  0.949272
314 -2.053885 -3.411428 -0.627885  2.221615
349  3.163753 -0.165057  0.361595 -0.831511
551  3.112928  0.487792  1.166221  1.578553
653 -3.083680  1.035899 -0.684633 -0.137287
875  2.593433  0.417693 -0.572906 -3.175443
972 -1.797029  3.055873  0.050962 -2.139189

In [50]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.064225     0.025091     0.025468    -0.023331
std       1.019316     1.012658     0.988452     1.012732
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.615654    -0.622421    -0.628045    -0.692036
50%       0.083076     0.034501     0.011147    -0.008419
75%       0.782310     0.711217     0.723474     0.715762
max       3.000000     3.000000     3.000000     2.853351

In [51]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2 -1.0 -1.0 -1.0  1.0
3  1.0  1.0 -1.0  1.0
4 -1.0  1.0 -1.0 -1.0

### Permutation and Random Sampling

In [52]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([3, 2, 4, 1, 0])

In [53]:
df
df.take(sampler)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3

In [54]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11

In [55]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

4    4
1    7
2   -1
1    7
3    6
2   -1
1    7
4    4
3    6
1    7
dtype: int64

### Computing Indicator/Dummy Variables

In [56]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [57]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

## String Manipulation

### String Object Methods

In [ ]:
val = 'a,b,  guido'
val.split(',')

In [ ]:
pieces = [x.strip() for x in val.split(',')]
pieces

In [ ]:
first, second, third = pieces
first + '::' + second + '::' + third

In [ ]:
'::'.join(pieces)

In [ ]:
'guido' in val
val.index(',')
val.find(':')

In [ ]:
val.index(':')

In [ ]:
val.count(',')

In [ ]:
val.replace(',', '::')
val.replace(',', '')

### Regular Expressions

In [ ]:
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

In [ ]:
regex = re.compile('\s+')
regex.split(text)

In [ ]:
regex.findall(text)

In [ ]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [ ]:
regex.findall(text)

In [ ]:
m = regex.search(text)
m
text[m.start():m.end()]

In [ ]:
print(regex.match(text))

In [ ]:
print(regex.sub('REDACTED', text))

In [ ]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [ ]:
m = regex.match('wesm@bright.net')
m.groups()

In [ ]:
regex.findall(text)

In [ ]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

### Vectorized String Functions in pandas

In [ ]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data
data.isnull()

In [ ]:
data.str.contains('gmail')

In [ ]:
pattern
data.str.findall(pattern, flags=re.IGNORECASE)

In [ ]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

In [ ]:
matches.str.get(1)
matches.str[0]

In [ ]:
data.str[:5]

In [ ]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS

## Conclusion

In [ ]:
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)